app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Great post!"], ["created_at", "2014-09-01 00:32:27.531759"], ["post_id", 1], ["updated_at", "2014-09-01 00:32:27.531759"]]