app/controllers/posts_controller.rb

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = 3  [["title", "My 3rd Post"], ["updated_at", "2014-09-02 00:34:37.643736"]]